In [1]:
import numpy as np
data = {i : np.random.randn() for i in range(7)}
data

{0: -0.220191262550793,
 1: -2.0369385142175696,
 2: 0.4150075913598373,
 3: 1.124777875130647,
 4: -1.1674362346433638,
 5: -0.7832478150045727,
 6: -0.21498247025515102}

In [7]:
for i in range(7):
     np.random.randn()

In [10]:
def add_numbers(a, b):
    return a + b

IndentationError: expected an indented block (<ipython-input-10-ca2e1ae4927b>, line 2)

In [11]:
import pandas as pd

In [12]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [13]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [14]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [15]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [16]:
obj2['a']

-5

In [18]:
obj2[['c', 'a', 'd']]

c    3
a   -5
d    4
dtype: int64

In [22]:
obj2 > 0

d     True
b     True
a    False
c     True
dtype: bool

In [23]:
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [24]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [25]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [36]:
frame[(frame['year']==2000) | (frame['pop']>1.5 ) ]

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002
5  3.2  Nevada  2003

In [37]:
frame.columns

Index(['pop', 'state', 'year'], dtype='object')

In [38]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [39]:
pop

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [40]:
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [41]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [42]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])

In [43]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [44]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [45]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [47]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data
data['two']
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [53]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int64

In [56]:
data.loc['Colorado', 'three']

6

In [57]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [58]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int64

In [59]:
data.iloc[:, :3]

          one  two  three
Ohio        0    1      2
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

In [60]:
[data.three > 5]

[Ohio        False
 Colorado     True
 Utah         True
 New York     True
 Name: three, dtype: bool]

In [61]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [69]:
df = data[data['three'] > 5]
df.iloc[:, :3]

          one  two  three
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

In [75]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])

#frame =np.abs(frame)
frame

               b         d         e
Utah    0.809166 -2.203164 -0.564595
Ohio   -0.186092  1.678441 -0.196342
Texas  -0.658242 -1.716813  0.174453
Oregon -0.258341  0.768449  0.492810

In [72]:
np.random.randn(4, 3)

array([[ 0.41193085, -1.24724912,  0.02188374],
       [ 0.38436741,  0.2745907 , -0.07715808],
       [-0.20684528,  1.61782891,  0.86424033],
       [-0.16000856,  0.07901954,  0.3985783 ]])

In [73]:
list('bde')

['b', 'd', 'e']

In [76]:
frame

               b         d         e
Utah    0.809166 -2.203164 -0.564595
Ohio   -0.186092  1.678441 -0.196342
Texas  -0.658242 -1.716813  0.174453
Oregon -0.258341  0.768449  0.492810

In [80]:
frame.apply(f)

b    0.809166
d    1.678441
e    0.492810
dtype: float64

In [83]:
frame.apply(f, axis='columns')

Utah      0.809166
Ohio      1.678441
Texas     0.174453
Oregon    0.768449
dtype: float64

In [79]:
f = lambda x: x.max() # - x.min()

In [ ]:
def f2(x):
    return x.max() - x.min()

In [86]:
df1 = pd.read_csv('Book3.csv')
df2 = pd.read_csv('avgsal2.csv')

In [89]:
df1

  Name  Agbe       City
0    A    24     Queens
1    B    34  Manhattan
2    C    30     Queens
3    D    34  Manhattan
4    E    34  Manhattan
5    F    20  Manhattan

In [91]:
pd.read_excel('salary.xlsx')

        City  AvgSalary
0     Queens      60000
1  Manhattan      80000
2   Brooklyn      65000

In [93]:
df1.to_pickle('df1pickle.p')

In [96]:
pd.read_pickle('df1pickle.p')

  Name  Agbe       City
0    A    24     Queens
1    B    34  Manhattan
2    C    30     Queens
3    D    34  Manhattan
4    E    34  Manhattan
5    F    20  Manhattan

In [108]:
from numpy import nan as NA


data = pd.DataFrame([[NA, 6.5, 3.], [NA, NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])
data.dropna()

Empty DataFrame
Columns: [0, 1, 2]
Index: []

In [103]:

data.dropna(how ='all' )

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [110]:
data.dropna(axis=1, how='all')

     1    2
0  6.5  3.0
1  NaN  NaN
2  NaN  NaN
3  6.5  3.0

In [109]:
data

    0    1    2
0 NaN  6.5  3.0
1 NaN  NaN  NaN
2 NaN  NaN  NaN
3 NaN  6.5  3.0

In [112]:
data.fillna(0)

     0    1    2
0  0.0  6.5  3.0
1  0.0  0.0  0.0
2  0.0  0.0  0.0
3  0.0  6.5  3.0

In [119]:
data.T.fillna({0: 0.5, 2: 0}).T

     0    1    2
0  0.5  6.5  3.0
1  NaN  NaN  NaN
2  0.0  0.0  0.0
3  NaN  6.5  3.0

In [114]:
data

    0    1    2
0 NaN  6.5  3.0
1 NaN  NaN  NaN
2 NaN  NaN  NaN
3 NaN  6.5  3.0

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [123]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}
lowercased = data['food'].str.lower()
lowercased
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [132]:
data.groupby('animal')['animal'].count()

animal
cow       3
pig       5
salmon    1
Name: animal, dtype: int64

In [138]:
df1

  Name City  Age  Salary Gender  Distance
0    A    M   32   12312      M        10
1    B    B   34  231231      F        14
2    C    Q   54  321321      F        32
3    D    M   43   32131      M        21

In [134]:
df2

  City  Avg Salary
0    M       15000
1    B       17000

In [137]:
df1 = pd.read_csv('pandas17june.csv')
df2 = pd.read_csv('avgsal2.csv')

In [141]:
df1.merge(df2, how='outer')

  Name City  Age  Salary Gender  Distance  Avg Salary
0    A    M   32   12312      M        10     15000.0
1    D    M   43   32131      M        21     15000.0
2    B    B   34  231231      F        14     17000.0
3    C    Q   54  321321      F        32         NaN

In [149]:

df3  =  pd.DataFrame ({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                    'data1': range(7)})
df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'],
                    'data2': range(3)})
pd.merge(df3, df4, left_on='lkey', right_on='rkey')[['data1','data2']]

   data1
0      0
1      1
2      6
3      2
4      4
5      5

In [150]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                    'data1': range(6)})
df2 = pd.DataFrame({'key': ['a', 'b', 'a', 'b', 'd'],
                    'data2': range(5)})
pd.merge(df1, df2, on='key', how='left')

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   b

In [151]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                    'data1': range(6)})
df2 = pd.DataFrame({'key': ['a', 'b', 'a', 'b', 'd'],
                    'data2': range(5)})
pd.merge(df1, df2, on='key', how='left')

    data1 key  data2
0       0   b    1.0
1       0   b    3.0
2       1   b    1.0
3       1   b    3.0
4       2   a    0.0
5       2   a    2.0
6       3   c    NaN
7       4   a    0.0
8       4   a    2.0
9       5   b    1.0
10      5   b    3.0

In [157]:

left1  =  pd.DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'],
                      'value': range(6)})
right1 = pd.DataFrame({'group_val': [3.5, 7]}, index=['a', 'b'])

In [159]:
right1

   group_val
a        3.5
b        7.0

In [161]:
pd.merge(left1, right1, left_on='key', right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [162]:
arr = np.arange(12).reshape((3, 4))
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [163]:
np.concatenate([arr, arr], axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [164]:
s1 = pd.Series([0, 1], index=['a', 'b'])
s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])
s3 = pd.Series([5, 6], index=['f', 'g'])

In [167]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [166]:
2

2

In [168]:
pd.concat([s1, s2, s3], axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [169]:
s4 = pd.concat([s1, s3])
s4

a    0
b    1
f    5
g    6
dtype: int64

In [174]:
pd.concat([s1, s4], axis=1 , join='inner')

   0  1
a  0  0
b  1  1

In [171]:
s1

a    0
b    1
dtype: int64

In [175]:
df1 = pd.DataFrame(np.random.randn(3, 4), columns=['a', 'b', 'c', 'd'])
df2 = pd.DataFrame(np.random.randn(2, 3), columns=['b', 'd', 'a'])

          b         d         a
0 -1.075296 -0.313686  0.234692
1  0.986586 -0.541572 -0.438007

In [176]:
df1

          a         b         c         d
0 -0.190051 -1.229797 -1.825832 -0.680077
1 -1.533790 -1.496080 -0.626367  0.269419
2  1.375154 -0.493000  1.228765 -0.341115

In [177]:
df2

          b         d         a
0 -1.075296 -0.313686  0.234692
1  0.986586 -0.541572 -0.438007

In [182]:
pd.concat([df1, df2], ignore_index=True)

          a         b         c         d
0 -0.190051 -1.229797 -1.825832 -0.680077
1 -1.533790 -1.496080 -0.626367  0.269419
2  1.375154 -0.493000  1.228765 -0.341115
3  0.234692 -1.075296       NaN -0.313686
4 -0.438007  0.986586       NaN -0.541572

In [183]:
data = pd.DataFrame(np.arange(6).reshape((2, 3)),
                    index=pd.Index(['Ohio', 'Colorado'], name='state'),
                    columns=pd.Index(['one', 'two', 'three'],
                    name='number'))
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [184]:
result = data.stack()
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int64

In [190]:
result['Ohio']['two']

1

In [186]:
result.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [191]:
result.unstack(0)

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [194]:
data = pd.read_csv('https://raw.githubusercontent.com/wesm/pydata-book/2nd-edition/examples/macrodata.csv')
data.head()

,year,quarter,realgdp,realcons,realinv,realgovt,realdpi,cpi,m1,tbilrate,unemp,pop,infl,realint
0,1959.0,1.0,2710.349,1707.4,286.898,470.045,1886.9,28.98,139.7,2.82,5.8,177.146,0.00,0.00
1,1959.0,2.0,2778.801,1733.7,310.859,481.301,1919.7,29.15,141.7,3.08,5.1,177.830,2.34,0.74
2,1959.0,3.0,2775.488,1751.8,289.226,491.260,1916.4,29.35,140.5,3.82,5.3,178.657,2.74,1.09
3,1959.0,4.0,2785.204,1753.7,299.356,484.052,1931.3,29.37,140.0,4.33,5.6,179.386,0.27,4.06
4,1960.0,1.0,2847.699,1770.5,331.722,462.199,1955.5,29.54,139.6,3.50,5.2,180.007,2.31,1.19

In [195]:
periods = pd.PeriodIndex(year=data.year, quarter=data.quarter,
                         name='date')
periods

PeriodIndex(['1959Q1', '1959Q2', '1959Q3', '1959Q4', '1960Q1', '1960Q2',
             '1960Q3', '1960Q4', '1961Q1', '1961Q2',
             ...
             '2007Q2', '2007Q3', '2007Q4', '2008Q1', '2008Q2', '2008Q3',
             '2008Q4', '2009Q1', '2009Q2', '2009Q3'],
            dtype='period[Q-DEC]', name='date', length=203, freq='Q-DEC')

In [196]:
columns = pd.Index(['realgdp', 'infl', 'unemp'], name='item')

In [197]:
data = data.reindex(columns=columns)
data

item    realgdp  infl  unemp
0      2710.349  0.00    5.8
1      2778.801  2.34    5.1
2      2775.488  2.74    5.3
3      2785.204  0.27    5.6
4      2847.699  2.31    5.2
5      2834.390  0.14    5.2
6      2839.022  2.70    5.6
7      2802.616  1.21    6.3
8      2819.264 -0.40    6.8
9      2872.005  1.47    7.0
10     2918.419  0.80    6.8
11     2977.830  0.80    6.2
12     3031.241  2.26    5.6
13     3064.709  0.13    5.5
14     3093.047  2.11    5.6
15     3100.563  0.79    5.5
16     3141.087  0.53    5.8
17     3180.447  2.75    5.7
18     3240.332  0.78    5.5
19     3264.967  2.46    5.6
20     3338.246  0.13    5.5
21     3376.587  0.90    5.2
22     3422.469  1.29    5.0
23     3431.957  2.05    5.0
24     3516.251  1.28    4.9
25     3563.960  2.54    4.7
26     3636.285  0.89    4.4
27     3724.014  2.90    4.1
28     3815.423  4.99    3.9
29     3828.124  2.10    3.8
..          ...   ...    ...
173   11538.770  1.56    5.8
174   11596.430  2.66    5.7
175   11598.824  3.08    5.8
176   11645.819  1.31    5.9
177   11738.706  1.09    6.2
178   11935.461  2.60    6.1
179   12042.817  3.02    5.8
180   12127.623  2.35    5.7
181   12213.818  3.61    5.6
182   12303.533  3.58    5.4
183   12410.282  2.09    5.4
184   12534.113  4.15    5.3
185   12587.535  1.85    5.1
186   12683.153  9.14    5.0
187   12748.699  0.40    4.9
188   12915.938  2.60    4.7
189   12962.462  3.97    4.7
190   12965.916 -1.58    4.7
191   13060.679  3.30    4.4
192   13099.901  4.58    4.5
193   13203.977  2.75    4.5
194   13321.109  3.45    4.7
195   13391.249  6.38    4.8
196   13366.865  2.82    4.9
197   13415.266  8.53    5.4
198   13324.600 -3.16    6.0
199   13141.920 -8.79    6.9
200   12925.410  0.94    8.1
201   12901.504  3.37    9.2
202   12990.341  3.56    9.6

[203 rows x 3 columns]

In [198]:
data.index = periods.to_timestamp('D', 'end')
data

item          realgdp  infl  unemp
date
1959-03-31   2710.349  0.00    5.8
1959-06-30   2778.801  2.34    5.1
1959-09-30   2775.488  2.74    5.3
1959-12-31   2785.204  0.27    5.6
1960-03-31   2847.699  2.31    5.2
1960-06-30   2834.390  0.14    5.2
1960-09-30   2839.022  2.70    5.6
1960-12-31   2802.616  1.21    6.3
1961-03-31   2819.264 -0.40    6.8
1961-06-30   2872.005  1.47    7.0
1961-09-30   2918.419  0.80    6.8
1961-12-31   2977.830  0.80    6.2
1962-03-31   3031.241  2.26    5.6
1962-06-30   3064.709  0.13    5.5
1962-09-30   3093.047  2.11    5.6
1962-12-31   3100.563  0.79    5.5
1963-03-31   3141.087  0.53    5.8
1963-06-30   3180.447  2.75    5.7
1963-09-30   3240.332  0.78    5.5
1963-12-31   3264.967  2.46    5.6
1964-03-31   3338.246  0.13    5.5
1964-06-30   3376.587  0.90    5.2
1964-09-30   3422.469  1.29    5.0
1964-12-31   3431.957  2.05    5.0
1965-03-31   3516.251  1.28    4.9
1965-06-30   3563.960  2.54    4.7
1965-09-30   3636.285  0.89    4.4
1965-12-31   3724.014  2.90    4.1
1966-03-31   3815.423  4.99    3.9
1966-06-30   3828.124  2.10    3.8
...               ...   ...    ...
2002-06-30  11538.770  1.56    5.8
2002-09-30  11596.430  2.66    5.7
2002-12-31  11598.824  3.08    5.8
2003-03-31  11645.819  1.31    5.9
2003-06-30  11738.706  1.09    6.2
2003-09-30  11935.461  2.60    6.1
2003-12-31  12042.817  3.02    5.8
2004-03-31  12127.623  2.35    5.7
2004-06-30  12213.818  3.61    5.6
2004-09-30  12303.533  3.58    5.4
2004-12-31  12410.282  2.09    5.4
2005-03-31  12534.113  4.15    5.3
2005-06-30  12587.535  1.85    5.1
2005-09-30  12683.153  9.14    5.0
2005-12-31  12748.699  0.40    4.9
2006-03-31  12915.938  2.60    4.7
2006-06-30  12962.462  3.97    4.7
2006-09-30  12965.916 -1.58    4.7
2006-12-31  13060.679  3.30    4.4
2007-03-31  13099.901  4.58    4.5
2007-06-30  13203.977  2.75    4.5
2007-09-30  13321.109  3.45    4.7
2007-12-31  13391.249  6.38    4.8
2008-03-31  13366.865  2.82    4.9
2008-06-30  13415.266  8.53    5.4
2008-09-30  13324.600 -3.16    6.0
2008-12-31  13141.920 -8.79    6.9
2009-03-31  12925.410  0.94    8.1
2009-06-30  12901.504  3.37    9.2
2009-09-30  12990.341  3.56    9.6

[203 rows x 3 columns]

In [199]:
ldata = data.stack().reset_index().rename(columns={0: 'value'})

In [201]:
ldata

          date     item      value
0   1959-03-31  realgdp   2710.349
1   1959-03-31     infl      0.000
2   1959-03-31    unemp      5.800
3   1959-06-30  realgdp   2778.801
4   1959-06-30     infl      2.340
5   1959-06-30    unemp      5.100
6   1959-09-30  realgdp   2775.488
7   1959-09-30     infl      2.740
8   1959-09-30    unemp      5.300
9   1959-12-31  realgdp   2785.204
10  1959-12-31     infl      0.270
11  1959-12-31    unemp      5.600
12  1960-03-31  realgdp   2847.699
13  1960-03-31     infl      2.310
14  1960-03-31    unemp      5.200
15  1960-06-30  realgdp   2834.390
16  1960-06-30     infl      0.140
17  1960-06-30    unemp      5.200
18  1960-09-30  realgdp   2839.022
19  1960-09-30     infl      2.700
20  1960-09-30    unemp      5.600
21  1960-12-31  realgdp   2802.616
22  1960-12-31     infl      1.210
23  1960-12-31    unemp      6.300
24  1961-03-31  realgdp   2819.264
25  1961-03-31     infl     -0.400
26  1961-03-31    unemp      6.800
27  1961-06-30  realgdp   2872.005
28  1961-06-30     infl      1.470
29  1961-06-30    unemp      7.000
..         ...      ...        ...
579 2007-06-30  realgdp  13203.977
580 2007-06-30     infl      2.750
581 2007-06-30    unemp      4.500
582 2007-09-30  realgdp  13321.109
583 2007-09-30     infl      3.450
584 2007-09-30    unemp      4.700
585 2007-12-31  realgdp  13391.249
586 2007-12-31     infl      6.380
587 2007-12-31    unemp      4.800
588 2008-03-31  realgdp  13366.865
589 2008-03-31     infl      2.820
590 2008-03-31    unemp      4.900
591 2008-06-30  realgdp  13415.266
592 2008-06-30     infl      8.530
593 2008-06-30    unemp      5.400
594 2008-09-30  realgdp  13324.600
595 2008-09-30     infl     -3.160
596 2008-09-30    unemp      6.000
597 2008-12-31  realgdp  13141.920
598 2008-12-31     infl     -8.790
599 2008-12-31    unemp      6.900
600 2009-03-31  realgdp  12925.410
601 2009-03-31     infl      0.940
602 2009-03-31    unemp      8.100
603 2009-06-30  realgdp  12901.504
604 2009-06-30     infl      3.370
605 2009-06-30    unemp      9.200
606 2009-09-30  realgdp  12990.341
607 2009-09-30     infl      3.560
608 2009-09-30    unemp      9.600

[609 rows x 3 columns]

In [202]:
df = pd.DataFrame({'key': ['foo', 'bar', 'baz'],
                   'A': [1, 2, 3],
                   'B': [4, 5, 6],
                   'C': [7, 8, 9]})
df

   A  B  C  key
0  1  4  7  foo
1  2  5  8  bar
2  3  6  9  baz

In [203]:
melted = pd.melt(df, ['key'])
melted

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6
6  foo        C      7
7  bar        C      8
8  baz        C      9

In [204]:
reshaped = melted.pivot('key', 'variable', 'value')
reshaped

variable  A  B  C
key
bar       2  5  8
baz       3  6  9
foo       1  4  7

In [206]:
df.pivot('key', 'A', 'C')

A      1    2    3
key
bar  NaN  8.0  NaN
baz  NaN  NaN  9.0
foo  7.0  NaN  NaN

In [207]:
df

   A  B  C  key
0  1  4  7  foo
1  2  5  8  bar
2  3  6  9  baz

In [208]:
pd.melt(df, id_vars=['key'], value_vars=['A', 'B'])

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6

In [209]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'key2' : ['one', 'two', 'one', 'two', 'one'],
                   'data1' : np.random.randn(5),
                   'data2' : np.random.randn(5)})
df

      data1     data2 key1 key2
0  0.127442 -2.032491    a  one
1 -0.170222 -1.358230    a  two
2 -1.874567  1.324808    b  one
3  1.132466  1.130705    b  two
4 -1.569673 -2.739483    a  one

In [214]:

grouped = df['data1'].groupby(df['key1'])
grouped

In [212]:
grouped.mean()

key1
a   -0.537484
b   -0.371051
Name: data1, dtype: float64

In [217]:
grouped.max()

key1
a    0.127442
b    1.132466
Name: data1, dtype: float64

In [218]:
import pandas as pd
from scipy import stats
#file['sex'].groupby(file['county']).agg([('modeSex', stats.mode)])
#https://stackoverflow.com/questions/36508487/group-by-with-mode-as-aggregator

In [220]:
df['key2'].groupby(df['key1']).agg([('Modefordata1', stats.mode)])

/home/nbuser/anaconda3_501/lib/python3.6/site-packages/scipy/stats/stats.py:253: RuntimeWarning: The input array could not be properly checked for nan values. nan values will be ignored.
  "values. nan values will be ignored.", RuntimeWarning)

      Modefordata1
key1
a     ([one], [2])
b     ([one], [1])

In [222]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()

key2
one   -0.721116
two   -0.170222
Name: data1, dtype: float64

In [223]:
means

key1  key2
a     one    -0.721116
      two    -0.170222
b     one    -1.874567
      two     1.132466
Name: data1, dtype: float64

In [224]:
means.unstack()

key2       one       two
key1
a    -0.721116 -0.170222
b    -1.874567  1.132466

In [225]:
from datetime import datetime
now = datetime.now()
now
now.year, now.month, now.day

(2018, 6, 30)

In [226]:
now

datetime.datetime(2018, 6, 30, 1, 21, 41, 897875)

In [227]:
datetime(2011, 1, 7)

datetime.datetime(2011, 1, 7, 0, 0)

In [228]:
delta = datetime(2011, 1, 7) - datetime(2008, 6, 24, 8, 15)

delta.seconds

56700

In [229]:
stamp = datetime(2011, 1, 3)
str(stamp)

'2011-01-03 00:00:00'

In [230]:
stamp.strftime('%Y-%m-%d')

'2011-01-03'

In [240]:
value = '11-January-03'
datetime.strptime(value, '%y-%B-%d')
#https://docs.python.org/2/library/datetime.html

datetime.datetime(2011, 1, 3, 0, 0)

In [241]:
datestrs = ['7/6/2011', '8/6/2011']
[datetime.strptime(x, '%m/%d/%Y') for x in datestrs]

[datetime.datetime(2011, 7, 6, 0, 0), datetime.datetime(2011, 8, 6, 0, 0)]

In [246]:
from dateutil.parser import parse
parse('2011-January-03')

datetime.datetime(2011, 1, 3, 0, 0)